server/app/services/create_reservation_service.rb

  def call
    client = Client.create!(@params[:client_attributes])

    Reservation.create!(
      start_date: @params[:start_date],
      end_date: @params[:end_date],
      client: client,
      cabin_id: @params[:cabin_id]
    )
---
INSERT INTO "clients" ("name", "email", "attachment_path", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "reservations" ("client_id", "start_date", "end_date", "invoice_generated", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client_id", 13], ["start_date", "2024-03-01"], ["end_date", "2024-03-06"], ["invoice_generated", nil], ["created_at", "2024-03-02 13:58:23.106661"], ["updated_at", "2024-03-02 13:58:23.106661"]]