server/app/services/invoice_generation_service.rb

  def call
    # Logic to generate invoice for the reservation
    puts "Generating invoice for reservation ID: #{@reservation.id}"
    invoice = Invoice.create(reservation_id: @reservation.id)
    @reservation.update(invoice_generated: true)
---
INSERT INTO "invoices" ("reservation_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["reservation_id", 16], ["created_at", "2024-03-02 14:46:23.661009"], ["updated_at", "2024-03-02 14:46:23.661009"]]
UPDATE "reservations" SET "invoice_generated" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["invoice_generated", true], ["updated_at", "2024-03-02 13:52:26.376891"], ["id", 11]]