server/app/controllers/reservations_controller.rb

SELECT "reservations"."start_date", "reservations"."end_date" FROM "reservations" WHERE "reservations"."cabin_id" = $1  [["cabin_id", 1]]
---
  def reservations
    reservations = Reservation.joins(:cabin).pluck('cabins.name', :start_date, :end_date)

    formatted_reservations = reservations.group_by { |cabin_name, _, _| cabin_name }.transform_values do |dates|