server/app/models/reservation.rb

  def check_availability
    overlapping_reservations = Reservation.where(cabin_id: cabin_id)
                                          .where('start_date < ? AND end_date > ?', end_date, start_date)
    if overlapping_reservations.exists?
---
SELECT 1 AS one FROM "reservations" WHERE "reservations"."cabin_id" = $1 AND (start_date < '2024-10-26' AND end_date > '2024-10-24') LIMIT $2  [["cabin_id", 1], ["LIMIT", 1]]